atomice1/sQLux-nextp8/esp8266_model.c
/*
 * ESP8266 ESP-01 Module Simulator - Main Implementation
 *
 * Manages state, initialization, UART integration, and polling
 *
 * Copyright (C) 2026 Chris January
 * GPL-3 with exception for sQLux linking
 */

#include "esp8266_model.h"
#include "esp8266_model_internal.h"
#include "esp8266_at_commands.h"
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <time.h>
#include <unistd.h>
#include <stdarg.h>
#include <sys/socket.h>
#include <sys/types.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <netdb.h>
#include <fcntl.h>
#include <errno.h>
#include <poll.h>
#include <openssl/ssl.h>
#include <openssl/err.h>

/* Forward Declarations ========== */

static uint64_t ESP8266_GetTimestampMS(void);
static void ESP8266_TXQueueChar(ESP8266_t *esp, uint8_t byte);
static void ESP8266_TXQueueString(ESP8266_t *esp, const char *str);
static void ESP8266_GenerateMAC(char *mac_str);
static VirtualAP* ESP8266_FindVirtualAP(const char *ssid);
static int ESP8266_SetNonBlocking(int fd);
static void ESP8266_CheckSocketData(ESP8266_t *esp);
int ESP8266_SocketClose(ESP8266_t *esp, uint8_t link_id);
static SSL_CTX *ssl_ctx = NULL;

/* ========== SSL Initialization ========== */

static void ESP8266_InitSSL(void) {
    if (ssl_ctx) return;

    SSL_library_init();
    SSL_load_error_strings();
    OpenSSL_add_all_algorithms();

    ssl_ctx = SSL_CTX_new(TLS_client_method());
    if (!ssl_ctx) {
        fprintf(stderr, "Failed to create SSL context\n");
        return;
    }

    // Disable certificate verification for simplicity
    SSL_CTX_set_verify(ssl_ctx, SSL_VERIFY_NONE, NULL);
}

/* ========== Virtual AP Database ========== */

static const VirtualAP virtual_aps[] = {
    {
        .ssid = "home-network",
        .password = "password123",
        .bssid = "aa:bb:cc:dd:ee:01",
        .channel = 6,
        .rssi = -45,
        .encryption = ENCRYPTION_WPA2_PSK
    },
    {
        .ssid = "coffee-wifi",
        .password = "",
        .bssid = "aa:bb:cc:dd:ee:02",
        .channel = 11,
        .rssi = -65,
        .encryption = ENCRYPTION_OPEN
    },
    {
        .ssid = "office-secure",
        .password = "corp-password",
        .bssid = "aa:bb:cc:dd:ee:03",
        .channel = 1,
        .rssi = -50,
        .encryption = ENCRYPTION_WPA_WPA2_PSK
    }
};

static const size_t NUM_VIRTUAL_APS = sizeof(virtual_aps) / sizeof(virtual_aps[0]);

/* ========== WiFi Management Functions (Internal) ========== */

/**
 * Initiate connection to a virtual AP
 * Returns 0 on success, -1 if AP not found or password wrong
 */
int ESP8266_WiFiConnect(ESP8266_t *esp, const char *ssid, const char *password) {
    if (!esp || !ssid) return -1;

    ESP8266_Internal *state = &esp->state;

    // Find the AP in virtual database
    VirtualAP *ap = ESP8266_FindVirtualAP(ssid);
    if (!ap) {
        return -1;  // AP not found
    }

    // Validate password (if AP is not OPEN)
    if (ap->encryption != ENCRYPTION_OPEN) {
        if (!password || strcmp(password, ap->password) != 0) {
            return -1;  // Wrong password
        }
    }

    // Save connection info
    strncpy(state->station_ssid, ssid, ESP8266_MAX_SSID_LEN);
    state->station_ssid[ESP8266_MAX_SSID_LEN] = '\0';

    if (password) {
        strncpy(state->station_password, password, ESP8266_MAX_PASSWORD_LEN);
        state->station_password[ESP8266_MAX_PASSWORD_LEN] = '\0';
    }

    // Transition to CONNECTING state
    state->wifi_state = WIFI_STATE_CONNECTING;
    state->wifi_state_change_time = ESP8266_GetTimestampMS();
    state->station_connected = 0;
    state->station_has_ip = 0;

    return 0;
}

/**
 * Disconnect from WiFi AP
 */
void ESP8266_WiFiDisconnect(ESP8266_t *esp) {
    if (!esp) return;

    ESP8266_Internal *state = &esp->state;

    state->wifi_state = WIFI_STATE_DISCONNECTED;
    state->station_connected = 0;
    state->station_has_ip = 0;
    memset(state->station_ssid, 0, sizeof(state->station_ssid));
    memset(state->station_password, 0, sizeof(state->station_password));

    ESP8266_ATUnsolicited(esp, "WiFi DISCONNECT");
}

/**
 * Get scan results from virtual AP database
 */
int ESP8266_WiFiScan(ESP8266_t *esp, ScanResult *results, int max_results) {
    if (!esp || !results) return 0;

    int count = 0;
    for (size_t i = 0; i < NUM_VIRTUAL_APS && count < max_results; i++) {
        results[count].encryption = virtual_aps[i].encryption;

        /* Copy SSID with explicit null termination */
        size_t ssid_len = strlen(virtual_aps[i].ssid);
        if (ssid_len > ESP8266_MAX_SSID_LEN) ssid_len = ESP8266_MAX_SSID_LEN;
        memcpy(results[count].ssid, virtual_aps[i].ssid, ssid_len);
        results[count].ssid[ssid_len] = '\0';

        results[count].rssi = virtual_aps[i].rssi;

        /* Copy BSSID with explicit null termination */
        size_t bssid_len = strlen(virtual_aps[i].bssid);
        if (bssid_len > ESP8266_MAX_MAC_STR_LEN) bssid_len = ESP8266_MAX_MAC_STR_LEN;
        memcpy(results[count].bssid, virtual_aps[i].bssid, bssid_len);
        results[count].bssid[bssid_len] = '\0';

        results[count].channel = virtual_aps[i].channel;
        results[count].freq_offset = 0;
        results[count].freq_cal = 0;
        count++;
    }

    return count;
}

/**
 * Get info about the currently connected AP
 * Returns 0 on success, -1 if not found
 */
int ESP8266_GetConnectedAPInfo(ESP8266_t *esp, char *bssid, uint8_t *channel, int8_t *rssi) {
    if (!esp) return -1;

    ESP8266_Internal *state = &esp->state;

    if (state->wifi_state != WIFI_STATE_GOT_IP) {
        return -1;  // Not connected
    }

    // Find the AP in database
    VirtualAP *ap = ESP8266_FindVirtualAP(state->station_ssid);
    if (!ap) return -1;

    if (bssid) {
        strncpy(bssid, ap->bssid, ESP8266_MAX_MAC_STR_LEN);
        bssid[ESP8266_MAX_MAC_STR_LEN] = '\0';
    }
    if (channel) *channel = ap->channel;
    if (rssi) *rssi = ap->rssi;

    return 0;
}

/* ========== Utility Functions ========== */

static uint64_t ESP8266_GetTimestampMS(void) {
    struct timespec ts;
    clock_gettime(CLOCK_MONOTONIC, &ts);
    return (uint64_t)ts.tv_sec * 1000 + ts.tv_nsec / 1000000;
}

static void ESP8266_GenerateMAC(char *mac_str) {
    // Generate a pseudo-random but consistent MAC
    // Format: aa:bb:cc:dd:ee:XX where XX is based on instance
    snprintf(mac_str, ESP8266_MAX_MAC_STR_LEN + 1,
             "aa:bb:cc:dd:ee:%02x", (unsigned)(rand() % 256));
}

static VirtualAP* ESP8266_FindVirtualAP(const char *ssid) {
    for (size_t i = 0; i < NUM_VIRTUAL_APS; i++) {
        if (strcmp(virtual_aps[i].ssid, ssid) == 0) {
            return (VirtualAP *)&virtual_aps[i];
        }
    }
    return NULL;
}

/* ========== TX Queue Functions ========== */

static void ESP8266_TXQueueChar(ESP8266_t *esp, uint8_t byte) {
    ESP8266_Internal *state = &esp->state;
    uint16_t next_head = (state->tx_head + 1) % ESP8266_TX_BUFFER_SIZE;

    // Drop if queue is full
    if (next_head == state->tx_tail) {
        printf("[ESP] TX buffer overflow, dropping byte\n");
        abort();
        return;
    }

