atomice1/sQLux-nextp8/esp8266_model.c
    state->tx_buffer[state->tx_head] = byte;
    state->tx_head = next_head;
}

static void ESP8266_TXQueueString(ESP8266_t *esp, const char *str) {
    printf("[ESP] Queuing response: %s\n", str);
    for (const char *p = str; *p; p++) {
        ESP8266_TXQueueChar(esp, (uint8_t)*p);
    }
}

/* ========== Public API Implementation ========== */

ESP8266_t* ESP8266_Create(void) {
    ESP8266_t *esp = (ESP8266_t *)malloc(sizeof(ESP8266_t));
    if (!esp) return NULL;

    memset(esp, 0, sizeof(ESP8266_t));

    // Initialize UART
    esp->state.uart_baud = ESP8266_DEFAULT_BAUD_RATE;
    esp->state.uart_databits = 8;
    esp->state.uart_stopbits = 1;
    esp->state.uart_parity = 0;
    esp->state.uart_flow_control = 0;

    // Initialize version strings
    snprintf(esp->state.at_version, sizeof(esp->state.at_version),
             "%s", ESP8266_AT_VERSION);
    snprintf(esp->state.sdk_version, sizeof(esp->state.sdk_version),
             "%s", ESP8266_SDK_VERSION);
    snprintf(esp->state.build_date, sizeof(esp->state.build_date),
             "%s", ESP8266_BUILD_DATE);

    // Initialize WiFi
    esp->state.wifi_mode = WIFI_MODE_STATION;
    esp->state.wifi_state = WIFI_STATE_DISCONNECTED;
    esp->state.dhcp_enabled[0] = 1;  // SoftAP DHCP enabled by default
    esp->state.dhcp_enabled[1] = 1;  // Station DHCP enabled by default

    // Generate MACs
    ESP8266_GenerateMAC(esp->state.station_mac);
    ESP8266_GenerateMAC(esp->state.ap_mac);

    // Initialize IP addresses
    snprintf(esp->state.station_ip, sizeof(esp->state.station_ip),
             "%s", ESP8266_DEFAULT_STATION_IP);
    snprintf(esp->state.station_gateway, sizeof(esp->state.station_gateway),
             "%s", ESP8266_DEFAULT_STATION_GATEWAY);
    snprintf(esp->state.station_netmask, sizeof(esp->state.station_netmask),
             "%s", ESP8266_DEFAULT_STATION_NETMASK);

    snprintf(esp->state.ap_ip, sizeof(esp->state.ap_ip),
             "%s", ESP8266_DEFAULT_AP_IP);
    esp->state.ap_channel = ESP8266_DEFAULT_AP_CHANNEL;
    esp->state.ap_encryption = ENCRYPTION_WPA2_PSK;

    // Initialize connections
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        esp->state.connections[i].active = 0;
        esp->state.connections[i].socket_fd = -1;
        esp->state.connections[i].ssl = NULL;
        esp->state.connections[i].rx_buffer = NULL;
        esp->state.connections[i].rx_buffer_len = 0;
    }

    // Initialize CIPSEND state
    esp->state.send_mode = 0;
    esp->state.send_link_id = 0;
    esp->state.send_bytes_expected = 0;
    esp->state.send_bytes_collected = 0;

    // Initialize SSL configuration
    esp->state.ssl_buffer_size = 2048;  // Default SSL buffer size

    // Initialize AT command system
    ESP8266_ATCommandsInit();

    return esp;
}

void ESP8266_Destroy(ESP8266_t *esp) {
    if (!esp) return;

    // Close any open sockets
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        if (esp->state.connections[i].active && esp->state.connections[i].socket_fd >= 0) {
            close(esp->state.connections[i].socket_fd);
        }
        if (esp->state.connections[i].rx_buffer) {
            free(esp->state.connections[i].rx_buffer);
        }
    }

    // Close server socket if active
    if (esp->state.server_active && esp->state.server_socket >= 0) {
        close(esp->state.server_socket);
    }

    free(esp);
}

void ESP8266_Reset(ESP8266_t *esp) {
    if (!esp) return;

    // Clear UART buffers
    esp->state.rx_head = 0;
    esp->state.rx_tail = 0;
    esp->state.tx_head = 0;
    esp->state.tx_tail = 0;
    esp->state.cmd_line_pos = 0;

    // Reset WiFi state
    esp->state.wifi_state = WIFI_STATE_DISCONNECTED;
    esp->state.station_connected = 0;
    esp->state.station_has_ip = 0;
    memset(esp->state.station_ssid, 0, sizeof(esp->state.station_ssid));
    memset(esp->state.station_password, 0, sizeof(esp->state.station_password));

    // Close all connections
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        if (esp->state.connections[i].active && esp->state.connections[i].socket_fd >= 0) {
            close(esp->state.connections[i].socket_fd);
        }
        esp->state.connections[i].active = 0;
        esp->state.connections[i].socket_fd = -1;
    }

    // Notify of reset
    ESP8266_ATUnsolicited(esp, "ready");
}

void ESP8266_ProcessUARTByte(ESP8266_t *esp, uint8_t byte) {
    if (!esp) return;

    /* // Debug: print sent byte
    if (byte >= 32 && byte < 127) {
        fprintf(stdout, "[ESP TX] '%c' (0x%02x)\n", byte, byte);
    } else if (byte == '\r') {
        fprintf(stdout, "[ESP TX] '\\r' (0x%02x)\n", byte);
    } else if (byte == '\n') {
        fprintf(stdout, "[ESP TX] '\\n' (0x%02x)\n", byte);
    } else {
        fprintf(stdout, "[ESP TX] 0x%02x\n", byte);
    }
    fflush(stdout);*/

    ESP8266_ATProcessByte(esp, byte);
}

int ESP8266_GetUARTByte(ESP8266_t *esp) {
    if (!esp) return -1;

    ESP8266_Internal *state = &esp->state;
    if (state->tx_head == state->tx_tail) {
        return -1;  // No data
    }

    uint8_t byte = state->tx_buffer[state->tx_tail];
    state->tx_tail = (state->tx_tail + 1) % ESP8266_TX_BUFFER_SIZE;

    /* // Debug: print received byte
    if (byte >= 32 && byte < 127) {
        fprintf(stdout, "[ESP RX] '%c' (0x%02x)\n", byte, byte);
    } else if (byte == '\r') {
        fprintf(stdout, "[ESP RX] '\\r' (0x%02x)\n", byte);
    } else if (byte == '\n') {
        fprintf(stdout, "[ESP RX] '\\n' (0x%02x)\n", byte);
    } else {
        fprintf(stdout, "[ESP RX] 0x%02x\n", byte);
    }
    fflush(stdout);*/

    return (int)byte;
}

void ESP8266_Poll(ESP8266_t *esp) {
    if (!esp) return;

    ESP8266_Internal *state = &esp->state;
    uint64_t now = ESP8266_GetTimestampMS();

    // Handle WiFi connection state machine
    if (state->wifi_state == WIFI_STATE_CONNECTING) {
        // Simulate 2 second connection delay
        if (now - state->wifi_state_change_time > 2000) {
            state->wifi_state = WIFI_STATE_CONNECTED;
            ESP8266_ATUnsolicited(esp, "WiFi CONNECTED");
            state->wifi_state_change_time = now;
        }
    } else if (state->wifi_state == WIFI_STATE_CONNECTED) {
        // Simulate 1 second DHCP delay
        if (now - state->wifi_state_change_time > 1000) {
            state->wifi_state = WIFI_STATE_GOT_IP;
            state->station_has_ip = 1;
            ESP8266_ATUnsolicited(esp, "WiFi GOT IP");
        }
    }

    // Handle TCP and SSL connection establishment
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        Connection *conn = &state->connections[i];

        if (!conn->active || conn->connected) continue;
        if (conn->type != CONNECTION_TYPE_TCP && conn->type != CONNECTION_TYPE_SSL) continue;

