atomice1/sQLux-nextp8/esp8266_model.c
        // Check if underlying TCP socket is connected
        struct pollfd pfd;
        pfd.fd = conn->socket_fd;
        pfd.events = POLLOUT;
        pfd.revents = 0;

        int ret = poll(&pfd, 1, 0);
        if (ret <= 0 || !(pfd.revents & POLLOUT)) {
            continue;  // Not ready yet
        }

        // Check for TCP connection error
        int error = 0;
        socklen_t len = sizeof(error);
        if (getsockopt(conn->socket_fd, SOL_SOCKET, SO_ERROR, &error, &len) < 0 || error != 0) {
            // TCP connection failed
            ESP8266_SocketClose(esp, i);
            char msg[64];
            snprintf(msg, sizeof(msg), "%d,CLOSED", i);
            ESP8266_ATUnsolicited(esp, msg);
            continue;
        }

        // TCP socket is connected successfully
        if (conn->type == CONNECTION_TYPE_TCP) {
            // Plain TCP - we're done
            conn->connected = 1;
            char msg[64];
            if (state->mux_enabled) {
                snprintf(msg, sizeof(msg), "%d,CONNECT", i);
            } else {
                snprintf(msg, sizeof(msg), "CONNECT");
            }
            ESP8266_ATUnsolicited(esp, msg);
        } else if (conn->type == CONNECTION_TYPE_SSL) {
            if (!conn->ssl) {
                // SSL object missing - shouldn't happen
                ESP8266_SocketClose(esp, i);
                char msg[64];
                snprintf(msg, sizeof(msg), "%d,CLOSED", i);
                ESP8266_ATUnsolicited(esp, msg);
                continue;
            }

            // SSL connection - try handshake
            SSL *ssl = (SSL*)conn->ssl;
            ret = SSL_connect(ssl);
            if (ret <= 0) {
                int ssl_err = SSL_get_error(ssl, ret);
                if (ssl_err != SSL_ERROR_WANT_READ && ssl_err != SSL_ERROR_WANT_WRITE) {
                    // SSL handshake failed
                    ESP8266_SocketClose(esp, i);
                    char msg[64];
                    snprintf(msg, sizeof(msg), "%d,CLOSED", i);
                    ESP8266_ATUnsolicited(esp, msg);
                }
                // Otherwise, handshake in progress (will retry next poll)
            } else {
                // SSL handshake completed successfully
                conn->connected = 1;
                char msg[64];
                if (state->mux_enabled) {
                    snprintf(msg, sizeof(msg), "%d,CONNECT", i);
                } else {
                    snprintf(msg, sizeof(msg), "CONNECT");
                }
                ESP8266_ATUnsolicited(esp, msg);
            }
        }
    }

    // Check all sockets for incoming data
    ESP8266_CheckSocketData(esp);
}

size_t ESP8266_TXDataAvailable(ESP8266_t *esp) {
    if (!esp) return 0;

    ESP8266_Internal *state = &esp->state;
    if (state->tx_head >= state->tx_tail) {
        return state->tx_head - state->tx_tail;
    } else {
        return ESP8266_TX_BUFFER_SIZE - (state->tx_tail - state->tx_head);
    }
}

void ESP8266_SetBaudRate(ESP8266_t *esp, uint32_t baud) {
    if (!esp) return;
    esp->state.uart_baud = baud;
}

uint32_t ESP8266_GetBaudRate(ESP8266_t *esp) {
    if (!esp) return 0;
    return esp->state.uart_baud;
}

void ESP8266_SetEcho(ESP8266_t *esp, uint8_t enabled) {
    if (!esp) return;
    esp->state.echo_enabled = enabled ? 1 : 0;
}

uint8_t ESP8266_GetEcho(ESP8266_t *esp) {
    if (!esp) return 0;
    return esp->state.echo_enabled;
}

WiFi_Mode ESP8266_GetWiFiMode(ESP8266_t *esp) {
    if (!esp) return WIFI_MODE_OFF;
    return esp->state.wifi_mode;
}

void ESP8266_SetWiFiMode(ESP8266_t *esp, WiFi_Mode mode) {
    if (!esp) return;
    esp->state.wifi_mode = mode;
}

WiFi_State ESP8266_GetWiFiState(ESP8266_t *esp) {
    if (!esp) return WIFI_STATE_DISCONNECTED;
    return esp->state.wifi_state;
}

const char* ESP8266_GetStationIP(ESP8266_t *esp) {
    if (!esp) return "";
    return esp->state.station_ip;
}

const char* ESP8266_GetAPIP(ESP8266_t *esp) {
    if (!esp) return "";
    return esp->state.ap_ip;
}

Connection* ESP8266_GetConnection(ESP8266_t *esp, uint8_t link_id) {
    if (!esp || link_id >= ESP8266_MAX_CONNECTIONS) return NULL;
    if (!esp->state.connections[link_id].active) return NULL;
    return &esp->state.connections[link_id];
}

void ESP8266_DebugPrint(ESP8266_t *esp) {
    if (!esp) return;

    ESP8266_Internal *state = &esp->state;
    printf("\n=== ESP8266 State ===\n");
    printf("UART: %u baud, %d data bits, %d stop bits, parity=%d, flow=%d\n",
           state->uart_baud, state->uart_databits, state->uart_stopbits,
           state->uart_parity, state->uart_flow_control);
    printf("Echo: %s\n", state->echo_enabled ? "ON" : "OFF");
    printf("WiFi Mode: %s\n", ESP8266_WiFiModeName(state->wifi_mode));
    printf("WiFi State: %s\n", ESP8266_WiFiStateName(state->wifi_state));
    printf("Station SSID: %s\n", state->station_ssid[0] ? state->station_ssid : "(none)");
    printf("Station IP: %s (has IP: %s)\n", state->station_ip, state->station_has_ip ? "yes" : "no");
    printf("Station MAC: %s\n", state->station_mac);
    printf("AP IP: %s\n", state->ap_ip);
    printf("AP SSID: %s\n", state->ap_ssid[0] ? state->ap_ssid : "(not configured)");
    printf("AP MAC: %s\n", state->ap_mac);
    printf("Connections: %d active\n", ESP8266_MAX_CONNECTIONS);
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        if (state->connections[i].active) {
            printf("  [%d] %s %s:%u (FD=%d)\n", i,
                   state->connections[i].type == CONNECTION_TYPE_TCP ? "TCP" :
                   state->connections[i].type == CONNECTION_TYPE_UDP ? "UDP" : "SSL",
                   state->connections[i].remote_ip,
                   state->connections[i].remote_port,
                   state->connections[i].socket_fd);
        }
    }
    printf("==================\n\n");
}

const char* ESP8266_WiFiStateName(WiFi_State state) {
    switch (state) {
        case WIFI_STATE_DISCONNECTED: return "DISCONNECTED";
        case WIFI_STATE_CONNECTING:   return "CONNECTING";
        case WIFI_STATE_CONNECTED:    return "CONNECTED";
        case WIFI_STATE_GOT_IP:       return "GOT_IP";
        case WIFI_STATE_FAILED:       return "FAILED";
        default:                      return "UNKNOWN";
    }
}

const char* ESP8266_WiFiModeName(WiFi_Mode mode) {
    switch (mode) {
        case WIFI_MODE_OFF:      return "OFF";
        case WIFI_MODE_STATION:  return "STATION";
        case WIFI_MODE_SOFTAP:   return "SOFTAP";
        case WIFI_MODE_DUAL:     return "DUAL";
        default:                 return "UNKNOWN";
    }
}

