atomice1/sQLux-nextp8/esp8266_model.c
/* ========== Socket Management Functions ========== */

/**
 * Set a file descriptor to non-blocking mode
 * Returns 0 on success, -1 on error
 */
static int ESP8266_SetNonBlocking(int fd) {
    int flags = fcntl(fd, F_GETFL, 0);
    if (flags == -1) return -1;
    return fcntl(fd, F_SETFL, flags | O_NONBLOCK);
}

/**
 * Create a TCP connection to remote host
 * Returns link_id on success, -1 on error
 */
int ESP8266_SocketConnect(ESP8266_t *esp, const char *remote_ip, uint16_t remote_port, Connection_Type type) {
    if (!esp || !remote_ip) return -1;

    ESP8266_Internal *state = &esp->state;

    // Find free connection slot
    int link_id = -1;
    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        if (!state->connections[i].active) {
            link_id = i;
            break;
        }
    }

    if (link_id == -1) {
        return -1;  // No free slots
    }

    // Create socket
    int sockfd;
    if (type == CONNECTION_TYPE_TCP || type == CONNECTION_TYPE_SSL) {
        sockfd = socket(AF_INET, SOCK_STREAM, 0);
    } else {  // UDP
        sockfd = socket(AF_INET, SOCK_DGRAM, 0);
    }

    if (sockfd < 0) {
        return -1;
    }

    // Set non-blocking
    if (ESP8266_SetNonBlocking(sockfd) < 0) {
        close(sockfd);
        return -1;
    }

    // Connect to remote host
    struct sockaddr_in server_addr;
    memset(&server_addr, 0, sizeof(server_addr));
    server_addr.sin_family = AF_INET;
    server_addr.sin_port = htons(remote_port);

    // Try to parse IP address
    if (inet_pton(AF_INET, remote_ip, &server_addr.sin_addr) <= 0) {
        // Not an IP, try DNS lookup
        struct hostent *host = gethostbyname(remote_ip);
        if (!host) {
            close(sockfd);
            return -1;
        }
        memcpy(&server_addr.sin_addr, host->h_addr_list[0], host->h_length);
    }

    // For TCP/SSL, initiate connection (non-blocking, will complete later)
    if (type == CONNECTION_TYPE_TCP || type == CONNECTION_TYPE_SSL) {
        int ret = connect(sockfd, (struct sockaddr*)&server_addr, sizeof(server_addr));
        if (ret < 0 && errno != EINPROGRESS) {
            close(sockfd);
            return -1;
        }
    }

    // Setup connection structure
    Connection *conn = &state->connections[link_id];
    memset(conn, 0, sizeof(Connection));
    conn->active = 1;
    conn->type = type;
    conn->is_server = 0;
    conn->socket_fd = sockfd;
    conn->ssl = NULL;
    // UDP is immediately ready, TCP/SSL need connection establishment
    conn->connected = (type == CONNECTION_TYPE_UDP) ? 1 : 0;
    strncpy(conn->remote_ip, remote_ip, ESP8266_MAX_IP_STR_LEN);
    conn->remote_port = remote_port;
    conn->local_port = 0;  // OS assigns

    // For SSL connections, create SSL object
    if (type == CONNECTION_TYPE_SSL) {
        ESP8266_InitSSL();
        if (ssl_ctx) {
            SSL *ssl = SSL_new(ssl_ctx);
            if (ssl) {
                SSL_set_fd(ssl, sockfd);
                // Set SNI (Server Name Indication) hostname
                SSL_set_tlsext_host_name(ssl, remote_ip);
                SSL_set_connect_state(ssl);
                // Non-blocking SSL_connect will happen in poll loop
                conn->ssl = ssl;
            }
        }
    }

    // Allocate RX buffer
    conn->rx_buffer = malloc(ESP8266_RX_BUFFER_SIZE);
    if (!conn->rx_buffer) {
        if (conn->ssl) SSL_free((SSL*)conn->ssl);
        close(sockfd);
        memset(conn, 0, sizeof(Connection));
        return -1;
    }
    conn->rx_buffer_len = ESP8266_RX_BUFFER_SIZE;
    conn->rx_buffer_pos = 0;

    return link_id;
}

/**
 * Close a connection
 * Returns 0 on success, -1 on error
 */
int ESP8266_SocketClose(ESP8266_t *esp, uint8_t link_id) {
    if (!esp || link_id >= ESP8266_MAX_CONNECTIONS) return -1;

    ESP8266_Internal *state = &esp->state;
    Connection *conn = &state->connections[link_id];

    if (!conn->active) return -1;

    if (conn->ssl) {
        SSL_shutdown((SSL*)conn->ssl);
        SSL_free((SSL*)conn->ssl);
        conn->ssl = NULL;
    }

    if (conn->socket_fd >= 0) {
        close(conn->socket_fd);
    }

    if (conn->rx_buffer) {
        free(conn->rx_buffer);
    }

    memset(conn, 0, sizeof(Connection));
    return 0;
}

/**
 * Send data on a connection
 * Returns number of bytes sent, -1 on error
 */
int ESP8266_SocketSend(ESP8266_t *esp, uint8_t link_id, const uint8_t *data, uint16_t len) {
    if (!esp || link_id >= ESP8266_MAX_CONNECTIONS || !data) return -1;

    ESP8266_Internal *state = &esp->state;
    Connection *conn = &state->connections[link_id];

    if (!conn->active) return -1;

    // Check if connection is established (for TCP/SSL)
    if ((conn->type == CONNECTION_TYPE_TCP || conn->type == CONNECTION_TYPE_SSL) && !conn->connected) {
        return -1;  // Not ready yet
    }

    // For UDP, we need to send to the remote address
    if (conn->type == CONNECTION_TYPE_UDP) {
        struct sockaddr_in addr;
        memset(&addr, 0, sizeof(addr));
        addr.sin_family = AF_INET;
        addr.sin_port = htons(conn->remote_port);
        inet_pton(AF_INET, conn->remote_ip, &addr.sin_addr);

        return sendto(conn->socket_fd, data, len, 0, (struct sockaddr*)&addr, sizeof(addr));
    } else if (conn->type == CONNECTION_TYPE_SSL && conn->ssl) {
        // SSL - check if handshake is complete first
        SSL *ssl = (SSL*)conn->ssl;
        if (!SSL_is_init_finished(ssl)) {
            // Handshake not complete yet
            errno = EAGAIN;
            return -1;
        }

        int ret = SSL_write(ssl, data, len);
        if (ret <= 0) {
            int ssl_err = SSL_get_error(ssl, ret);
            if (ssl_err == SSL_ERROR_WANT_WRITE || ssl_err == SSL_ERROR_WANT_READ) {
                errno = EAGAIN;
            }
            return -1;
        }
        return ret;
    } else {
        // TCP
        return send(conn->socket_fd, data, len, 0);
    }
}

/**
 * Check all active sockets for incoming data
 * Called from ESP8266_Poll()
 */
static void ESP8266_CheckSocketData(ESP8266_t *esp) {
    if (!esp) return;

