atomice1/sQLux-nextp8/esp8266_model.c
    ESP8266_Internal *state = &esp->state;

    // Build poll array for all active connections
    struct pollfd fds[ESP8266_MAX_CONNECTIONS];
    int fd_to_link[ESP8266_MAX_CONNECTIONS];
    int nfds = 0;

    for (int i = 0; i < ESP8266_MAX_CONNECTIONS; i++) {
        if (state->connections[i].active && state->connections[i].socket_fd >= 0) {
            fds[nfds].fd = state->connections[i].socket_fd;
            fds[nfds].events = POLLIN;
            fds[nfds].revents = 0;
            fd_to_link[nfds] = i;
            nfds++;
        }
    }

    if (nfds == 0) return;

    // Poll with 0 timeout (non-blocking check)
    int ret = poll(fds, nfds, 0);
    if (ret <= 0) return;

    // Check each socket for data
    for (int i = 0; i < nfds; i++) {
        if (fds[i].revents & POLLIN) {
            int link_id = fd_to_link[i];
            Connection *conn = &state->connections[link_id];

            // Try to read data into RX buffer
            // rx_buffer is used as a temporary staging area - always read from beginning
            if (conn->rx_buffer_len > 0) {
                ssize_t bytes_read;
                if (conn->type == CONNECTION_TYPE_UDP) {
                    bytes_read = recvfrom(conn->socket_fd,
                                        conn->rx_buffer,
                                        conn->rx_buffer_len, 0, NULL, NULL);
                } else if (conn->type == CONNECTION_TYPE_SSL && conn->ssl) {
                    // SSL read
                    bytes_read = SSL_read((SSL*)conn->ssl,
                                        conn->rx_buffer,
                                        conn->rx_buffer_len);
                    if (bytes_read <= 0) {
                        int ssl_err = SSL_get_error((SSL*)conn->ssl, bytes_read);
                        if (ssl_err == SSL_ERROR_WANT_READ || ssl_err == SSL_ERROR_WANT_WRITE) {
                            bytes_read = -1;
                            errno = EAGAIN;
                        } else {
                            bytes_read = 0;  // Connection closed or error
                        }
                    }
                } else {
                    // TCP read
                    bytes_read = recv(conn->socket_fd,
                                    conn->rx_buffer,
                                    conn->rx_buffer_len, 0);
                }

                if (bytes_read > 0) {
                    // Got data! Send +IPD unsolicited message
                    // Format: \r\n+IPD,<len>:<data>\r\n (no CRLF between : and data!)
                    char ipd_header[64];
                    if (state->mux_enabled) {
                        snprintf(ipd_header, sizeof(ipd_header), "\r\n+IPD,%d,%d:", link_id, (int)bytes_read);
                    } else {
                        snprintf(ipd_header, sizeof(ipd_header), "\r\n+IPD,%d:", (int)bytes_read);
                    }
                    ESP8266_TXQueueString(esp, ipd_header);

                    // Queue the actual data
                    for (ssize_t j = 0; j < bytes_read; j++) {
                        ESP8266_TXQueueChar(esp, conn->rx_buffer[j]);
                    }

                    // Queue terminating CRLF
                    ESP8266_TXQueueString(esp, "\r\n");

                    // rx_buffer is reused on each read, no need to increment rx_buffer_pos
                } else if (bytes_read == 0 || (bytes_read < 0 && errno != EAGAIN && errno != EWOULDBLOCK)) {
                    // Connection closed or error
                    if (state->mux_enabled) {
                        ESP8266_ATUnsolicited(esp, "%d,CLOSED", link_id);
                    } else {
                        ESP8266_ATUnsolicited(esp, "CLOSED");
                    }
                    ESP8266_SocketClose(esp, link_id);
                }
            }
        }
    }
}

/* ========== Internal Response Functions ========== */

void ESP8266_ATResponse(ESP8266_t *esp, const char *fmt, ...) {
    if (!esp) return;

    char buffer[ESP8266_RESPONSE_BUFFER_SIZE];
    va_list args;
    va_start(args, fmt);
    vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);

    ESP8266_TXQueueString(esp, buffer);
    ESP8266_TXQueueString(esp, "\r\n");
}

void ESP8266_ATUnsolicited(ESP8266_t *esp, const char *fmt, ...) {
    if (!esp) return;

    char buffer[ESP8266_RESPONSE_BUFFER_SIZE];
    va_list args;
    va_start(args, fmt);
    vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);

    ESP8266_TXQueueString(esp, buffer);
    ESP8266_TXQueueString(esp, "\r\n");
}

void ESP8266_ATError(ESP8266_t *esp) {
    if (!esp) return;
    ESP8266_TXQueueString(esp, "ERROR\r\n");
}

void ESP8266_ATOKK(ESP8266_t *esp) {
    if (!esp) return;
    ESP8266_TXQueueString(esp, "OK\r\n");
}
